Repository: xiao99xiao/AutoShell
Catalog: AutoShell/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: %@ · Exit code %d
zh_hans: %@ · 退出码 %d

source: Action could not be completed
zh_hans: 操作未完成

source: Add AutoShell to your login items manually
zh_hans: 将 AutoShell 手动添加到系统登录项

source: Add GitHub runners, development servers, or other long-running commands. They can start automatically the next time AutoShell opens.
zh_hans: 添加 GitHub Runner、开发服务或其他常驻命令。 下次打开 AutoShell，它们就能自动启动。

source: Add Task
zh_hans: 添加任务

source: Add Task ⌘N
zh_hans: 添加任务 ⌘N

source: Add Your First Task
zh_hans: 添加第一个任务

source: Advanced Settings
zh_hans: 高级设置

source: AutoShell · Live log (read-only; press Control-C to stop viewing)
zh_hans: AutoShell · 实时日志（只读，按 Control-C 结束查看）

source: AutoShell · Running: %lld
zh_hans: AutoShell · %lld 个运行中

source: AutoShell · Running: %lld · Failed: %lld
zh_hans: AutoShell · %lld 个运行中 · %lld 个失败

source: Automatic Restart
zh_hans: 定时重启

source: Cancel
zh_hans: 取消

source: Check status, manage tasks, and read logs.
zh_hans: 查看运行状态、管理任务和阅读日志。

source: Choose Working Directory
zh_hans: 选择工作目录

source: Choose…
zh_hans: 选择…

source: Completed
zh_hans: 已完成

source: Configuration cannot contain null characters.
zh_hans: 配置不能包含空字符。

source: Configure once. Run automatically when AutoShell opens.
zh_hans: 配置一次，每次打开 App 自动运行。

source: Configure…
zh_hans: 设置…

source: Copy Log
zh_hans: 复制日志

source: Copy the displayed log
zh_hans: 复制当前显示的日志

source: Could not create the log file. Check directory permissions.
zh_hans: 无法创建日志文件，请检查目录权限。

source: Could not read task configuration. The original file was preserved. Check %@: %@
zh_hans: 无法读取任务配置，原文件已保留。请检查 %@：%@

source: Could not write the log: %@
zh_hans: 日志写入失败：%@

source: Days
zh_hans: 天

source: Delete
zh_hans: 删除

source: Delete Task…
zh_hans: 删除任务…

source: Delete task?
zh_hans: 删除任务？

source: Delete the configuration for “%@”? Existing logs will stay on this Mac.
zh_hans: 删除“%@”的配置。已有日志会保留在本地。

source: Delete…
zh_hans: 删除…

source: Display paused · Still recording
zh_hans: 显示已暂停 · 后台仍在记录

source: Duplicate task IDs.
zh_hans: 任务 ID 重复。

source: Edit
zh_hans: 编辑

source: Edit Task
zh_hans: 编辑任务

source: Edit Task…
zh_hans: 编辑任务…

source: Edit…
zh_hans: 编辑…

source: Enter a command to run.
zh_hans: 请输入要执行的命令。

source: Enter a task name.
zh_hans: 请输入任务名称。

source: Enter a valid interval of at least 1 second.
zh_hans: 请输入至少 1 秒的有效间隔。

source: Enter one environment variable per line as KEY=value.
zh_hans: 环境变量需每行填写 KEY=value。

source: Environment Variables
zh_hans: 环境变量

source: Environment Variables (one KEY=value per line)
zh_hans: 环境变量（每行 KEY=value）

source: Every %@
zh_hans: 每隔 %@

source: Exit code %d
zh_hans: 退出码 %d

source: Failed
zh_hans: 运行失败

source: Follow Output
zh_hans: 跟随输出

source: For example, ./run.sh. Keep commands in the foreground; do not add & or nohup.
zh_hans: 例如 ./run.sh。使用前台常驻命令，不要添加 & 或 nohup。

source: Hours
zh_hans: 小时

source: Interval
zh_hans: 间隔

source: Invalid environment variable name: %@
zh_hans: 环境变量名称无效：%@

source: Keep commands running. Free your Terminal.
zh_hans: 让命令常驻，让 Terminal 自由

source: Latest 128 KB · Rotating logs (2 × 5 MB)
zh_hans: 最近 128 KB · 本地日志自动轮转（2 × 5 MB）

source: Logs
zh_hans: 运行日志

source: Manage Tasks…
zh_hans: 管理任务…

source: Manual start
zh_hans: 手动启动

source: Minutes
zh_hans: 分钟

source: More Actions
zh_hans: 更多操作

source: Next restart: %@
zh_hans: 下次重启：%@

source: No log file yet. Start the task once to create one.
zh_hans: 任务还没有日志。启动一次任务后即可查看日志文件。

source: No output yet
zh_hans: 还没有输出

source: No tasks yet
zh_hans: 还没有任务

source: OK
zh_hans: 好

source: Off
zh_hans: 已关闭

source: Open Login Items Settings
zh_hans: 打开登录项设置

source: Pause Display
zh_hans: 暂停显示

source: Pauses the display only. The task and log recording continue.
zh_hans: 只暂停画面，任务和日志记录继续运行

source: Quit AutoShell and Stop Tasks
zh_hans: 退出 AutoShell 并停止任务

source: Read-only output
zh_hans: 只读输出

source: Restart
zh_hans: 重新启动

source: Restart every
zh_hans: 重启间隔

source: Restart on failure
zh_hans: 失败后自动重启

source: Restart periodically
zh_hans: 按间隔重复重启

source: Resume Display
zh_hans: 继续显示

source: Resumes when the task starts
zh_hans: 任务启动后恢复计时

source: Run commands that need interactive input in Terminal
zh_hans: 需要交互输入的命令请在 Terminal 中运行

source: Running
zh_hans: 运行中

source: Running tasks: %lld
zh_hans: %lld 个任务运行中

source: Runs a noninteractive login shell. Loads login configuration, but not .zshrc.
zh_hans: 以非交互登录 Shell 运行，会读取登录配置；不会自动读取 .zshrc。

source: Save
zh_hans: 保存

source: Save Task
zh_hans: 保存任务

source: Saving does not start the command.
zh_hans: 保存不会立即运行命令。

source: Scheduled restart is due.
zh_hans: 已到定时重启时间。

source: Search logs
zh_hans: 搜索日志

source: Seconds
zh_hans: 秒

source: Select a task
zh_hans: 选择一个任务

source: Shell Command
zh_hans: Shell 命令

source: Shell Path
zh_hans: Shell 路径

source: Show Log in Finder
zh_hans: 在 Finder 中显示日志

source: Start
zh_hans: 启动

source: Start All
zh_hans: 启动全部

source: Start Task
zh_hans: 启动任务

source: Start the task to see standard output and errors here.
zh_hans: 启动任务后，标准输出和错误信息会出现在这里。

source: Start with AutoShell
zh_hans: 随 AutoShell 启动

source: Started PID %d
zh_hans: 启动 PID %d

source: Started at %@
zh_hans: 启动于 %@

source: Starts with the app
zh_hans: 随 App 启动

source: Stop
zh_hans: 停止

source: Stop All
zh_hans: 停止全部

source: Stop the task before editing its configuration.
zh_hans: 请先停止任务，再修改配置。

source: Stopped
zh_hans: 已停止

source: Stopping
zh_hans: 正在停止

source: Stopping the task pauses the schedule. Starting it resumes the schedule. Unexpected exits follow the task’s failure settings. An overdue restart runs once after your Mac wakes.
zh_hans: 停止任务会暂停计时，启动任务后恢复。意外退出仍按任务的失败处理设置执行。睡眠期间到期的重启会在 Mac 唤醒后执行一次。

source: Stopping; remaining processes will be forced to quit after 5 seconds.
zh_hans: 正在停止；5 秒后仍未退出将强制结束。

source: Task Name
zh_hans: 任务名称

source: Tasks keep running when the window closes
zh_hans: 关闭窗口后，任务继续运行

source: Tasks keep running when this window closes. Return from the menu bar anytime.
zh_hans: 关闭窗口后继续运行。 从菜单栏随时回来。

source: Tasks · %lld
zh_hans: 任务 · %lld

source: Terminal could not be found.
zh_hans: 未找到 Terminal。

source: The existing configuration cannot be read and will not be overwritten. Repair tasks.json and restart AutoShell.
zh_hans: 原配置无法读取，已阻止覆盖。请先修复 tasks.json 并重启 App。

source: The interval starts when you save these settings or start the task. Each restart waits for the current process to stop before starting a new one.
zh_hans: 保存设置或启动任务时开始计时。每次重启都会等待当前进程结束，再启动新进程。

source: The shell must be an absolute path to an executable file.
zh_hans: Shell 必须是可执行文件的绝对路径。

source: The working directory does not exist. Choose another directory.
zh_hans: 工作目录不存在，请重新选择。

source: Time Unit
zh_hans: 时间单位

source: Values are passed literally; no quotes needed. Configuration is stored locally in plain text.
zh_hans: 值按原样传入，无需引号。配置保存在本机，请勿填写需要加密保管的密钥。

source: View Logs and Details
zh_hans: 查看日志与详情

source: View in Terminal
zh_hans: 在 Terminal 查看

source: Waiting to restart
zh_hans: 等待重启

source: Waits 5–60 seconds before restarting. Normal exits and manual stops do not trigger a restart.
zh_hans: 自动重启等待 5–60 秒；正常退出或手动停止不会触发。

source: Working Directory
zh_hans: 工作目录

source: e.g. GitHub Runner
zh_hans: 例如：GitHub Runner
